Tool Rental Test Cases.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-07-18 Sun 22:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Tool Rental Test Cases</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Palmer Cluff">
</head>
<body>
<div id="content">
<h1 class="title">Tool Rental Test Cases</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6728c34">1. Test Cases</a>
<ul>
<li><a href="#org958d157">1.1. Test Case 1 (PASS)</a>
<ul>
<li><a href="#org43a96a6">1.1.1. Checkout Terms</a></li>
<li><a href="#org5f1b1fb">1.1.2. Input/Output</a></li>
<li><a href="#org3f81b14">1.1.3. Notes</a></li>
</ul>
</li>
<li><a href="#orgd7db58b">1.2. Test Case 2 (PASS)</a>
<ul>
<li><a href="#orge1b68fb">1.2.1. Checkout Terms</a></li>
<li><a href="#orgd6cb050">1.2.2. Input/Output</a></li>
<li><a href="#orgc1711bc">1.2.3. Notes</a></li>
</ul>
</li>
<li><a href="#org7141fe0">1.3. Test Case 3 (PASS)</a>
<ul>
<li><a href="#org70ce389">1.3.1. Checkout Terms</a></li>
<li><a href="#orgc25807b">1.3.2. Input/Output</a></li>
<li><a href="#orgf4aea33">1.3.3. Notes</a></li>
</ul>
</li>
<li><a href="#orgcfc5382">1.4. Test Case 4 (PASS)</a>
<ul>
<li><a href="#org6056d4e">1.4.1. Checkout Terms</a></li>
<li><a href="#org9a68d49">1.4.2. Input/Output</a></li>
<li><a href="#orgc1ac2f4">1.4.3. Notes</a></li>
</ul>
</li>
<li><a href="#org6fc68a2">1.5. Test Case 5 (PASS)</a>
<ul>
<li><a href="#org5e634e7">1.5.1. Checkout Terms</a></li>
<li><a href="#orgd962235">1.5.2. Input/Output</a></li>
<li><a href="#org1284422">1.5.3. Notes</a></li>
</ul>
</li>
<li><a href="#org137aac0">1.6. Test Case 6 (PASS)</a>
<ul>
<li><a href="#org120a08d">1.6.1. Checkout Terms</a></li>
<li><a href="#org4acf4d7">1.6.2. Input/Output</a></li>
<li><a href="#orgf20ee52">1.6.3. Notes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6728c34" class="outline-2">
<h2 id="org6728c34"><span class="section-number-2">1</span> Test Cases</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org958d157" class="outline-3">
<h3 id="org958d157"><span class="section-number-3">1.1</span> Test Case 1 (PASS)</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org43a96a6" class="outline-4">
<h4 id="org43a96a6"><span class="section-number-4">1.1.1</span> Checkout Terms</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Tool code: JAKR</li>
<li>Checkout date: 9/3/15</li>
<li>Rental Days: 5</li>
<li>Discount: 101%</li>
</ul>
</div>
</div>

<div id="outline-container-org5f1b1fb" class="outline-4">
<h4 id="org5f1b1fb"><span class="section-number-4">1.1.2</span> Input/Output</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
Tool Type       Brand           Tool Code       
Ladder          Werner          LADW            
Chainsaw        Stihl           CHNS            
Jackhammer      Ridgid          JAKR            
Jackhammer      DeWalt          JAKD            
Please select which tool that you would like to use based off of tool code: JAKR
Please enter the date (MM/DD/YYYY) when you will CHECKOUT the item(s): 9/3/15
Please enter how many days you will checkout the item(s) for: 5
Please enter an optional discount percent (0 for no discount percent): 101
Discount percent must be within 0 and 100
Please enter an optional discount percent (0 for no discount percent):
</pre>
</div>
</div>

<div id="outline-container-org3f81b14" class="outline-4">
<h4 id="org3f81b14"><span class="section-number-4">1.1.3</span> Notes</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
As per the specification, the program does not allow a discount percent greater than 100 and in the case of this implementation, will keep prompting until a valid discount percent is entered.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd7db58b" class="outline-3">
<h3 id="orgd7db58b"><span class="section-number-3">1.2</span> Test Case 2 (PASS)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge1b68fb" class="outline-4">
<h4 id="orge1b68fb"><span class="section-number-4">1.2.1</span> Checkout Terms</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Tool code: LADW</li>
<li>Checkout date: 7/2/20</li>
<li>Rental Days: 3</li>
<li>Discount: 10%</li>
</ul>
</div>
</div>

<div id="outline-container-orgd6cb050" class="outline-4">
<h4 id="orgd6cb050"><span class="section-number-4">1.2.2</span> Input/Output</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
Tool Type       Brand           Tool Code       
Ladder          Werner          LADW            
Chainsaw        Stihl           CHNS            
Jackhammer      Ridgid          JAKR            
Jackhammer      DeWalt          JAKD            
Please select which tool that you would like to use based off of tool code: LADW
Please enter the date (MM/DD/YYYY) when you will CHECKOUT the item(s): 7/2/20
Please enter how many days you will checkout the item(s) for: 3
Please enter an optional discount percent (0 for no discount percent): 10
Tool code: LADW
Tool type: Ladder
Tool brand: Werner
Rental days: 3
Checkout date: 07-02-20
Due date: 07-05-20
Daily rental charge:
Wed 07-03-20:  $1.99
Thu 07-04-20:  $0.0
Fri 07-05-20:  $1.99
Charge days: 2
Pre-discount charge: $3.98
Discount percent: 10%
Discount amount: $0.40
Final Charge: $3.58
</pre>
</div>
</div>

<div id="outline-container-orgc1711bc" class="outline-4">
<h4 id="orgc1711bc"><span class="section-number-4">1.2.3</span> Notes</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
As July 4th falls on a weekend, there is no rental charge for this weekday (holiday) for ladder.
</p>
</div>
</div>
</div>

<div id="outline-container-org7141fe0" class="outline-3">
<h3 id="org7141fe0"><span class="section-number-3">1.3</span> Test Case 3 (PASS)</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org70ce389" class="outline-4">
<h4 id="org70ce389"><span class="section-number-4">1.3.1</span> Checkout Terms</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Tool code: CHNS</li>
<li>Checkout date: 7/2/15</li>
<li>Rental Days: 5</li>
<li>Discount: 25%</li>
</ul>
</div>
</div>

<div id="outline-container-orgc25807b" class="outline-4">
<h4 id="orgc25807b"><span class="section-number-4">1.3.2</span> Input/Output</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example">
Tool Type       Brand           Tool Code       
Ladder          Werner          LADW            
Chainsaw        Stihl           CHNS            
Jackhammer      Ridgid          JAKR            
Jackhammer      DeWalt          JAKD            
Please select which tool that you would like to use based off of tool code: CHNS
Please enter the date (MM/DD/YYYY) when you will CHECKOUT the item(s): 7/2/15
Please enter how many days you will checkout the item(s) for: 5
Please enter an optional discount percent (0 for no discount percent): 25
Tool code: CHNS
Tool type: Chainsaw
Tool brand: Stihl
Rental days: 5
Checkout date: 07-02-15
Due date: 07-07-15
Daily rental charge:
Wed 07-03-15:  $1.49
Thu 07-04-15:  $1.49
Fri 07-05-15:  $1.49
Sat 07-06-15:  $0.0
Sun 07-07-15:  $0.0
Charge days: 3
Pre-discount charge: $4.47
Discount percent: 25%
Discount amount: $1.12
Final Charge: $3.35
</pre>
</div>
</div>

<div id="outline-container-orgf4aea33" class="outline-4">
<h4 id="orgf4aea33"><span class="section-number-4">1.3.3</span> Notes</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
For cahinsaws, since there are only charges for weekends and holidays, there are no charges for Sat. and Sun.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcfc5382" class="outline-3">
<h3 id="orgcfc5382"><span class="section-number-3">1.4</span> Test Case 4 (PASS)</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org6056d4e" class="outline-4">
<h4 id="org6056d4e"><span class="section-number-4">1.4.1</span> Checkout Terms</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Tool code: JAKD</li>
<li>Checkout date: 9/3/15</li>
<li>Rental Days: 6</li>
<li>Discount: 0%</li>
</ul>
</div>
</div>

<div id="outline-container-org9a68d49" class="outline-4">
<h4 id="org9a68d49"><span class="section-number-4">1.4.2</span> Input/Output</h4>
<div class="outline-text-4" id="text-1-4-2">
<pre class="example">
Tool Type       Brand           Tool Code       
Ladder          Werner          LADW            
Chainsaw        Stihl           CHNS            
Jackhammer      Ridgid          JAKR            
Jackhammer      DeWalt          JAKD            
Please select which tool that you would like to use based off of tool code: JAKD
Please enter the date (MM/DD/YYYY) when you will CHECKOUT the item(s): 9/3/15
Please enter how many days you will checkout the item(s) for: 6
Please enter an optional discount percent (0 for no discount percent): 0
Tool code: JAKD
Tool type: Jackhammer
Tool brand: DeWalt
Rental days: 6
Checkout date: 09-03-15
Due date: 09-09-15
Daily rental charge:
Wed 09-04-15:  $2.99
Thu 09-05-15:  $2.99
Fri 09-06-15:  $2.99
Sat 09-07-15:  $0.0
Sun 09-08-15:  $0.0
Mon 09-09-15:  $2.99
Charge days: 4
Pre-discount charge: $11.96
Discount percent: 0%
Discount amount: $0.00
Final Charge: $11.96
</pre>
</div>
</div>

<div id="outline-container-orgc1ac2f4" class="outline-4">
<h4 id="orgc1ac2f4"><span class="section-number-4">1.4.3</span> Notes</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
For Jackhammer, since no holiday in date range and no charges on weekends.
</p>
</div>
</div>
</div>

<div id="outline-container-org6fc68a2" class="outline-3">
<h3 id="org6fc68a2"><span class="section-number-3">1.5</span> Test Case 5 (PASS)</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org5e634e7" class="outline-4">
<h4 id="org5e634e7"><span class="section-number-4">1.5.1</span> Checkout Terms</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Tool code: JAKR</li>
<li>Checkout date: 7/2/15</li>
<li>Rental Days: 9</li>
<li>Discount: 0%</li>
</ul>
</div>
</div>

<div id="outline-container-orgd962235" class="outline-4">
<h4 id="orgd962235"><span class="section-number-4">1.5.2</span> Input/Output</h4>
<div class="outline-text-4" id="text-1-5-2">
<pre class="example">
Tool Type       Brand           Tool Code       
Ladder          Werner          LADW            
Chainsaw        Stihl           CHNS            
Jackhammer      Ridgid          JAKR            
Jackhammer      DeWalt          JAKD            
Please select which tool that you would like to use based off of tool code: JAKR
Please enter the date (MM/DD/YYYY) when you will CHECKOUT the item(s): 7/2/15
Please enter how many days you will checkout the item(s) for: 9
Please enter an optional discount percent (0 for no discount percent): 0
Tool code: JAKR
Tool type: Jackhammer
Tool brand: Ridgid
Rental days: 9
Checkout date: 07-02-15
Due date: 07-11-15
Daily rental charge:
Wed 07-03-15:  $2.99
Thu 07-04-15:  $0.0
Fri 07-05-15:  $2.99
Sat 07-06-15:  $0.0
Sun 07-07-15:  $0.0
Mon 07-08-15:  $2.99
Tue 07-09-15:  $2.99
Wed 07-10-15:  $2.99
Thu 07-11-15:  $2.99
Charge days: 6
Pre-discount charge: $17.94
Discount percent: 0%
Discount amount: $0.00
Final Charge: $17.94
</pre>
</div>
</div>

<div id="outline-container-org1284422" class="outline-4">
<h4 id="org1284422"><span class="section-number-4">1.5.3</span> Notes</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Note that the 4th of July falls on a weekday and no charges on weekends as per requirements.
</p>
</div>
</div>
</div>

<div id="outline-container-org137aac0" class="outline-3">
<h3 id="org137aac0"><span class="section-number-3">1.6</span> Test Case 6 (PASS)</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org120a08d" class="outline-4">
<h4 id="org120a08d"><span class="section-number-4">1.6.1</span> Checkout Terms</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li>Tool code: JAKR</li>
<li>Checkout date: 7/2/20</li>
<li>Rental Days: 4</li>
<li>Discount: 50%</li>
</ul>
</div>
</div>

<div id="outline-container-org4acf4d7" class="outline-4">
<h4 id="org4acf4d7"><span class="section-number-4">1.6.2</span> Input/Output</h4>
<div class="outline-text-4" id="text-1-6-2">
<pre class="example">
Tool Type       Brand           Tool Code       
Ladder          Werner          LADW            
Chainsaw        Stihl           CHNS            
Jackhammer      Ridgid          JAKR            
Jackhammer      DeWalt          JAKD            
Please select which tool that you would like to use based off of tool code: JAKR
Please enter the date (MM/DD/YYYY) when you will CHECKOUT the item(s): 7/2/20
Please enter how many days you will checkout the item(s) for: 4
Please enter an optional discount percent (0 for no discount percent): 50
Tool code: JAKR
Tool type: Jackhammer
Tool brand: Ridgid
Rental days: 4
Checkout date: 07-02-20
Due date: 07-06-20
Daily rental charge:
Wed 07-03-20:  $2.99
Thu 07-04-20:  $0.0
Fri 07-05-20:  $2.99
Sat 07-06-20:  $0.0
Charge days: 2
Pre-discount charge: $5.98
Discount percent: 50%
Discount amount: $2.99
Final Charge: $2.99
</pre>
</div>
</div>

<div id="outline-container-orgf20ee52" class="outline-4">
<h4 id="orgf20ee52"><span class="section-number-4">1.6.3</span> Notes</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Correct charges as per requirements
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author"><b>Author:</b> Palmer Cluff</p>
<p class="email"><b>Email:</b> <a href="mailto:palmercluff@gmail.com">palmercluff@gmail.com</a></p>
<p class="modified_date"><b>Report Modified:</b> 2021-07-18 Sun 22:25</p>
<p class="exported_date"><b>Report Generated:</b> 2021-07-18 Sun 22:44</p>
<p class="creator"><b>Created with:</b> <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
</div>
</body>
</html>
